Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་ལས་ལངས་ནས། འགོག་པའི་སྙོམས་པར་འཇུག་པ་ལ་སྙོམས་པར་འཇུག་གོ །
en: Then, arising from the absorption of the sphere of neither perception nor nonperception, they become absorbed in the absorption of cessation.

source: འགོག་པའི་སྙོམས་པར་འཇུག་པ་ལས་ལངས་ནས། མཉམ་པར་མ་བཞག་པའི་སེམས་སུ་བྱེད་དོ།
en: Then, arising from the absorption of cessation, they engage with the state of nonabsorbed mind.

source: །མཉམ་པར་མ་བཞག་པའི་སེམས་ལས་ལངས་ནས་འགོག་པའི་སྙོམས་པར་འཇུག་པ་ལ་སྙོམས་པར་འཇུག་གོ།
en: Then, arising from that state of nonabsorbed mind, they become absorbed in the absorption of cessation.

source: །འགོག་པའི་སྙོམས་པར་འཇུག་པ་ལས་ལངས་ནས། མཉམ་པར་མ་བཞག་པའི་སེམས་ལ་གནས་སོ།
en: Then, arising from the absorption of cessation, they dwell in the state of nonabsorbed mind.

source: །མཉམ་པར་མ་བཞག་པའི་སེམས་ལས་ལངས་ནས་འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་ལ་སྙོམས་པར་འཇུག་གོ །
en: Then, arising from that state of nonabsorbed mind, they become absorbed in the absorption of the sphere of neither perception nor nonperception.

source: འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་ལས་ལངས་ནས། མཉམ་པར་མ་བཞག་པའི་སེམས་ལ་གནས་སོ།
en: Then, arising from that absorption of the sphere of neither perception nor nonperception, they dwell in the state of nonabsorbed mind.

source: །མཉམ་པར་མ་བཞག་པའི་སེམས་ལས་ལངས་ནས་ཅུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་ལ་སྙོམས་པར་འཇུག་གོ །
en: Then, arising from that state of nonabsorbed mind, {Ki.V: 104} they become absorbed in the absorption of the sphere of nothing-at-all.

source: ཅུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་ལས་ལངས་ནས། མཉམ་པར་མ་བཞག་པའི་སེམས་ལ་གནས་སོ།
en: Then, arising from that absorption of the sphere of nothing-at-all, they dwell in the state of nonabsorbed mind.

source: །མཉམ་པར་མ་བཞག་པའི་སེམས་ལས་ལངས་ནས། རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ལ་སྙོམས་པར་འཇུག་གོ །
en: Then, arising from that state of nonabsorbed mind, they become absorbed in the sphere of infinite consciousness.

source: རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་ལས་ལངས་ནས། མཉམ་པར་མ་བཞག་པའི་སེམས་ལ་གནས་སོ།
en: Then, arising from that absorption in the sphere of infinite consciousness, they dwell in the state of nonabsorbed mind.

source: །མཉམ་པར་མ་བཞག་པའི་སེམས་ལས་ལངས་ནས། ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ལ་སྙོམས་པར་འཇུག་གོ །
en: Then, arising from that state of nonabsorbed mind, they become absorbed in the sphere of infinite space.

source: ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ལས་ལངས་ནས། མཉམ་པར་མ་བཞག་པའི་སེམས་ལ་གནས་སོ།
en: Then, arising from that sphere of infinite space, they dwell in the state of nonabsorbed mind.

source: །མཉམ་པར་མ་བཞག་པའི་སེམས་ལས་ལངས་ནས། བསམ་གཏན་བཞི་པ་ལ་སྙོམས་པར་འཇུག་གོ །
en: Then, arising from that state of nonabsorbed mind, they become absorbed in the fourth meditative concentration.

source: བསམ་གཏན་བཞི་པ་ལས་ལངས་ནས། མཉམ་པར་མ་བཞག་པའི་སེམས་སུ་བྱེད་དོ།
en: Then, arising from that fourth meditative concentration, they engage with the state of nonabsorbed mind.

source: །མཉམ་པར་མ་བཞག་པའི་སེམས་ལས་ལངས་ནས། བསམ་གཏན་གསུམ་པ་ལ་སྙོམས་པར་འཇུག་གོ །
en: Then, arising from that state of nonabsorbed mind, they become absorbed in the third meditative concentration.

source: བསམ་གཏན་གསུམ་པ་ལས་ལངས་ནས། མཉམ་པར་མ་བཞག་པའི་སེམས་སུ་བྱེད་དོ།
en: Then, arising from that third meditative concentration, they engage with the state of nonabsorbed mind.

source: །མཉམ་པར་མ་བཞག་པའི་སེམས་ལས་ལངས་ནས། བསམ་གཏན་གཉིས་པ་ལ་སྙོམས་པར་འཇུག་གོ །
en: Then, arising from that state of nonabsorbed mind, they become absorbed in the second meditative concentration.

source: བསམ་གཏན་གཉིས་པ་ལས་ལངས་ནས། མཉམ་པར་མ་བཞག་པའི་སེམས་སུ་བྱེད་དོ།
en: Then, arising from that second meditative concentration, they engage with the state of nonabsorbed mind.

source: །མཉམ་པར་མ་བཞག་པའི་སེམས་ལས་ལངས་ནས། བསམ་གཏན་དང་པོ་ལ་སྙོམས་པར་འཇུག་གོ །
en: Then, arising from that state of nonabsorbed mind, they become absorbed in the first meditative concentration.

source: བསམ་གཏན་དང་པོ་ལས་ལངས་ནས། མཉམ་པར་མ་བཞག་པའི་སེམས་སུ་བྱེད་དོ།
en: Then, arising from that first meditative concentration, they engage with the state of nonabsorbed mind.

source: །དེ་ཐོད་རྒལ་གྱི་ཏིང་ངེ་འཛིན་འདི་ལ་གནས་ཤིང་། ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་རྗེས་སུ་འཐོབ་པར་བྱེད་དེ།
en: Abiding in this all-surpassing meditative stability, they attain the sameness of all phenomena.

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་ཏོ།
en: It is in this way, Subhūti, that bodhisattva great beings, abiding in the perfection of wisdom, acquire the perfection of meditative concentration.”

source: ལེའུ་ལྔ་བཅུ་གཉིས་པའོ།། །།དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཐབས་མཁས་པ་དེ་ལྟ་བུ་དང་ལྡན་པ་དེ་ཡུན་རིང་པོ་ཇི་སྲིད་ཅིག་ནས་ཡང་དག་པར་ཞུགས་པ་ལགས།
en: V: 50} Chapter 53 Then the venerable Subhūti asked the Blessed One, “Blessed Lord, for how long have bodhisattva great beings who possess such skill in means set out [on this path]?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་ཐབས་མཁས་པ་དེ་ལྟ་བུ་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་གྲངས་མེད་པ་ནས་ཡང་དག་པར་ཞུགས་པ་ཡིན་ནོ། །གསོལ་པ།
en: Subhūti, bodhisattva great beings who possess such skill in means have set out [on this path] for countless billion trillions of eons,” replied the Blessed One. “

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐབས་མཁས་པ་དེ་ལྟ་བུ་དང་ལྡན་པ་དེས་སངས་རྒྱས་ཇི་སྙེད་ཅིག་བསྙེན་བཀུར་བ་ལགས།
en: Blessed Lord, how many buddhas have those bodhisattva great beings who possess such skill in means revered?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་ཐབས་མཁས་པ་དེ་ལྟ་བུ་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེས་ནི་སངས་རྒྱས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་བསྙེན་བཀུར་བར་རིག་པར་བྱའོ།
en: Subhūti, you should know that those bodhisattva great beings who possess such skill in means have revered as many buddhas as the grains of sand of the river Gaṅgā,” replied the Blessed One. “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐབས་མཁས་པ་དེ་ལྟ་བུ་དང་ལྡན་པ་དེས་དགེ་བའི་རྩ་བ་ཅི་ཞིག་བསྐྱེད་པ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, what are the roots of virtuous action that those bodhisattva great beings who possess such skill in means have cultivated?”

source: སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐབས་མཁས་པ་དེ་ལྟ་བུ་དང་ལྡན་པ་དེས་ཡོངས་སུ་རྫོགས་པར་མ་བྱས་པའི་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པའི་བྱ་བ་དེ་ལྟ་བུ་གང་ཡང་མེད་དོ།
en: The Blessed One replied, “Starting from the time when they first began to set their mind on enlightenment, there is no notion at all of any such perfection of generosity that those bodhisattva great beings who possess such skill in means have not completed.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེས་ཡོངས་སུ་རྫོགས་པར་མ་བྱས་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་བྱ་བ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པའི་བྱ་བ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་བྱ་བ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་བྱ་བ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་བྱ་བ་དེ་ལྟ་བུ་གང་ཡང་མེད་དོ།
en: There is no notion at all of any such perfection of ethical discipline, perfection of tolerance, perfection of perseverance, perfection of meditative concentration, or perfection of wisdom that those bodhisattva great beings who possess such skill in means have not completed.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐབས་མཁས་པ་དེ་ལྟ་བུ་དང་ལྡན་པ་དེ་དག་ནི་ངོ་མཚར་ཆེའོ།
en: Blessed Lord, those bodhisattva great beings who possess such skill in means are most wonderful!” {

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐབས་མཁས་པ་དེ་ལྟ་བུ་དང་ལྡན་པ་དེ་དག་ནི་ངོ་མཚར་ཆེའོ།
en: Those bodhisattva great beings who possess such skill in means are most wonderful!

source: །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན། ཉི་མའི་དཀྱིལ་འཁོར་དང་། ཟླ་བའི་དཀྱིལ་འཁོར་ནི་གླིང་བཞིར་ལས་བྱེད་ཅིང་གླིང་བཞིའི་རྗེས་སུ་འགྲོའོ། །གླིང་བཞིའི་རྗེས་སུ་འབྲང་ངོ་། །རབ་འབྱོར་དེ་བཞིན་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡང་ཕ་རོལ་དུ་ཕྱིན་པ་ལྔའི་ལས་བྱེད་ཅིང་ཕ་རོལ་དུ་ཕྱིན་པ་ལྔའི་རྗེས་སུ་འགྲོ །
en: Subhūti, just as the orb of the sun and the orb of the moon have an impact upon the four continents, follow the four continents, and move around the four continents, in the same way, Subhūti, the perfection of wisdom has an impact upon the other five perfections.

source: རྗེས་སུ་འབྲང་སྟེ།
en: It follows the other five perfections and moves around them.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་མ་བྲལ་ན། ཕ་རོལ་དུ་ཕྱིན་པ་ལྔ་ཕ་རོལ་དུ་ཕྱིན་པའི་མིང་འཐོབ་བོ།
en: It is because they are inseparable from the perfection of wisdom that the other five perfections acquire the designation perfection.

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་བྲལ་ན། ཕ་རོལ་དུ་ཕྱིན་པ་ལྔ་ཕ་རོལ་དུ་ཕྱིན་པ་ལྔའི་མིང་མི་འཐོབ་བོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན།
en: If they were without the perfection of wisdom, the other five perfections would not acquire the designation perfection. “

source: འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་དང་བྲལ་ན། རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་འཁོར་ལོས་སྒྱུར་བའི་མིང་མི་འཐོབ་བོ། །རབ་འབྱོར་དེ་བཞིན་དུ་ཕ་རོལ་དུ་ཕྱིན་པ་ལྔ་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་བྲལ་ན། ཕ་རོལ་དུ་ཕྱིན་པའི་མིང་མི་འཐོབ་བོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན།
en: Subhūti, just as without an imperial monarch, the seven precious insignia of royal dominion would not acquire the designation imperial, in the same way, Subhūti, if they were without the perfection of wisdom, the other five perfections would not acquire the designation perfection. “

source: ཁྱིམ་ཐབ་མེད་པའི་བུད་མེད་རྣམས་ནི་འཕྱོན་མ་པ་རྣམས་ཀྱིས་ཚུགས་པར་སླ་བ་ཡིན་ནོ། །རབ་འབྱོར་དེ་བཞིན་དུ་ཕ་རོལ་དུ་ཕྱིན་པ་ལྔ་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་བྲལ་ན། བདུད་དམ་བདུད་ཀྱི་རིས་ཀྱི་ལྷ་རྣམས་ཀྱིས་ཚུགས་པར་སླ་བ་ཡིན་ནོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན།
en: Subhūti, just as it is easy for promiscuous men to harm women without a husband, in the same way, Subhūti, if they were without the perfection of wisdom, it would be easy for those other five perfections to be harmed by Māra or by gods in the realm of Māra.

source: ཁྱིམ་ཐབ་དཔའ་བོས་ཤིན་དུ་བསྲུངས་པའི་བུད་མེད་ཤིན་དུ་ཕུན་སུམ་ཚོགས་པའི་ཁྱིམ་ན་འདུག་པ་ནི་འཕྱོན་མ་པ་རྣམས་ཀྱིས་མི་ཚུགས་པ་ཡིན་ནོ། །རབ་འབྱོར་དེ་བཞིན་དུ་ཕ་རོལ་དུ་ཕྱིན་པ་ལྔ་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་མ་བྲལ་ན། བདུད་དམ་བདུད་ཀྱི་རིས་ཀྱི་ལྷ་རྣམས་ཀྱིས་མི་ཚུགས་པ་ཡིན་ནོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན།
en: Subhūti, just as promiscuous men cannot harm a woman staying in an excellent household, protected by a strong husband, in the same way, Subhūti, if they are not without the perfection of wisdom, it will not be easy for those other five perfections to be harmed by Māra or by gods in the realm of Māra. “

source: གཡུལ་དུ་འགྲོ་བའི་སྐྱེས་བུ་གོ་ཆ་ཚང་བར་གྱོན་པ། མཚོན་ཆ་ཐམས་ཅད་ཐོགས་པ་ནི་གཡུལ་ངོ་ན་འདུག་པའི་ཚེ། རྒྱལ་པོའི་ཟླའམ་ཕྱིར་རྒོལ་བ་དང་། དགྲ་རྣམས་ཀྱིས་ཐུབ་པར་དཀའོ།
en: Subhūti, it is just as when a man goes out to battle dressed in full armor and stands in the face of battle, struck by all sorts of weapons, and it is difficult for hostile kings, assailants, or enemies to conquer him.

source: །རབ་འབྱོར་དེ་བཞིན་དུ་ཕ་རོལ་དུ་ཕྱིན་པ་ལྔ་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་མ་བྲལ་ན། བདུད་དང་བདུད་ཀྱི་རིས་ཀྱི་ལྷ་རྣམས་དང་། གང་ཟག་ལྷག་པའི་ང་རྒྱལ་ཅན་ནམ། བྱང་ཆུབ་སེམས་དཔའ་གདོལ་བ་རྣམས་ཀྱིས་ཀྱང་ཐོབ་པར་དཀའོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན།
en: In the same way, Subhūti, if they are not without the perfection of wisdom, it will be difficult for those other five perfections to be conquered by Māra or by gods in the realm of Māra, by individuals of overweening pride, or even by outcaste bodhisattvas. “

source: འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ལ་ཁམས་ཀྱི་རྒྱལ་པོ་ཡོད་པ་རྣམས་ནི་ནང་ནུབ་ནང་ནུབ་ཅིང་རིམ་གྲོ་བྱ་བའི་དོན་དུ་དྲུང་དུ་འོང་ངོ་། །རབ་འབྱོར་དེ་བཞིན་དུ་ཕ་རོལ་དུ་ཕྱིན་པ་ལྔ་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པས་ཡོངས་སུ་ཟིན་ན། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་གང་ན་བ་དེར་འདོང་ངོ་།
en: Subhūti, just as regional kings succumb to an imperial monarch, and approach to act in his service, in the same way, Subhūti, if the five other perfections have been retained by the perfection of wisdom, they will proceed into the presence of all-aspect omniscience. “

source: །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན། ཆུ་ཀླུང་གང་ཇི་སྙེད་ཅིག་ཡོད་པ་ཐམས་ཅད་ནི་ཆུ་ཀླུང་ཆེན་པོ་གང་གཱ་གང་ན་བ་དེར་འདོང་སྟེ། དེ་དག་ཆུ་ཀླུང་གང་གཱ་དང་འགྲོགས་ཤིང་རྒྱ་མཚོ་ཆེན་པོའི་ནང་དུ་འདོང་ངོ་། །རབ་འབྱོར་དེ་བཞིན་དུ་ཕ་རོལ་དུ་ཕྱིན་པ་ལྔ་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པས་ཡོངས་སུ་ཟིན་ན། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་གང་ན་བ་དེར་འདོང་ངོ་།
en: Subhūti, just as all tributaries that there are flow into the great river Gaṅgā, and along with the river Gaṅgā, flow into the great ocean, in the same way, Subhūti, if the five other perfections have been retained by the perfection of wisdom, they will proceed into the presence of all-aspect omniscience. “

source: །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན། སྐྱེས་བུའི་ལག་པ་གཡས་པ་ནི་དགོས་པ་ཐམས་ཅད་བྱེད་དོ། །རབ་འབྱོར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡང་དེ་བཞིན་དུ་བལྟ་སྟེ། ཕ་རོལ་དུ་ཕྱིན་པ་ལྔ་ནི་ལག་པ་གཡོན་པ་ཇི་ལྟ་བ་བཞིན་དུ་བལྟའོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན།
en: Subhūti, just as a person’s right hand performs all sorts of functions, in the same way, Subhūti, is the perfection of wisdom to be regarded—the other five perfections being comparable with the left hand. {

source: །ཆུ་ཀླུང་ཕྲ་མོ་རྣམས་ཀྱི་ཆུ་དང་།
en: Ki.

source: ཆུ་ཀླུང་ཆེན་པོ་རྣམས་ཀྱི་ཆུ་གང་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་རྒྱ་མཚོ་ཆེན་པོར་ཕྱིན་ན། །འདི་ལྟ་སྟེ། ལན་ཚྭའི་རོར་རོ་གཅིག་པར་འགྱུར་རོ། །རབ་འབྱོར་དེ་བཞིན་དུ་ཕ་རོལ་དུ་ཕྱིན་པ་ལྔ་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པས་ཡོངས་སུ་ཟིན་ན། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཕྱིན་པའི་ཚེ། འདི་ལྟ་སྟེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རོར་རོ་གཅིག་པར་འགྱུར་རོ།
en: V: 52} “Subhūti, just as all the water that there is, including the water of tributaries and the water of wide rivers, flows into an ocean, so that it becomes salty to taste and of a single savor, in the same way, Subhūti, if the five other perfections have been retained by the perfection of wisdom, when they proceed to all-aspect omniscience, they will become of a single savor, in the taste of all-aspect omniscience. “

source: །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན། འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོའི་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་དང་ལྡན་པའི་མདུན་དུ་ནི་འཁོར་ལོ་རིན་པོ་ཆེ་འགྲོ་ཞིང་འདུག་སྟེ། གང་དུ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ཟས་ཀྱི་དོན་དུ་འདུག་པར་གྱུར་པ་དེར། འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོའི་དཔུང་གི་ཚོགས་ཐམས་ཅད་ཡོངས་སུ་ཚིམ་པར་བྱེད་ཅིང་། འཁོར་ལོ་རིན་པོ་ཆེ་དེ་གནས་ནས་གཡོ་བ་མེད་དོ།
en: Subhūti, it is just as the precious wheel, [the standard of royal dominion], proceeds and stays in the vanguard of the army of an imperial monarch, with its four corps—such that in the place where the imperial monarch halts to partake of food, all the armed forces of that imperial monarch are refreshed and do not move while [the standard of] the precious wheel remains there.

source: །རབ་འབྱོར་དེ་བཞིན་དུ་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལྔ་པོ་འདི་དག་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པས་ཡོངས་སུ་བཀྲི་བ་ཡིན་ཏེ།
en: In the same way, Subhūti, these five other perfections have been led by the perfection of wisdom.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་གང་ན་བ་དེར་འདོང་ཞིང་དེར་གནས་སོ།
en: They proceed into the presence of all-aspect omniscience and remain there.

source: །དེར་གནས་པར་གྱུར་ནས་ཀྱང་གནས་དེ་ལས་མི་འདའོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན། འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོའི་འཁོར་ལོ་རིན་པོ་ཆེ་དེ་དང་། བློན་པོ་རིན་པོ་ཆེ་དེ་དང་། ཁྱིམ་བདག་རིན་པོ་ཆེ་དེ་དང་།
en: Having halted there, they do not cease to remain there. “

source: བུད་མེད་རིན་པོ་ཆེ་དེ་དང་། ནོར་བུ་རིན་པོ་ཆེ་དེ་དང་། གླང་པོ་རིན་པོ་ཆེ་དེ་དང་། རྟ་རིན་པོ་ཆེ་དེ་དག་ནི་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་དང་ལྡན་པའི་མདུན་དུ་འདོང་ངོ་། །རབ་འབྱོར་དེ་བཞིན་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡང་ཕ་རོལ་དུ་ཕྱིན་པ་ལྔ་པོ་འདི་དག་གི་མདུན་དུ་འགྲོ་སྟེ།
en: Subhūti, just as [the seven insignia of royal dominion] belonging to an imperial monarch—the precious wheel, the precious minister, the precious householder, the precious queen consort, the precious gem, the precious elephant, and the precious horse—proceed in the vanguard of an army with its four divisions, in the same way, Subhūti, the perfection of wisdom also proceeds in the vanguard of these five other perfections.

source: མདུན་དུ་སོང་ནས་ཀྱང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་གང་ན་བ་དེར་གནས་པར་འགྱུར་ཏེ།
en: Proceeding in the vanguard, it then halts in the presence of all-aspect omniscience.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་འདི་སྙམ་དུ་བདག་གི་ཕྱི་བཞིན་དུ་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་འབྲང་ངོ་སྙམ་དུ་མི་སེམས་སོ།
en: The perfection of wisdom does not then think, ‘May the perfection of generosity follow, outside of me.’

source: །འདི་སྙམ་དུ་བདག་གི་ཕྱི་བཞིན་དུ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འབྲང་ངོ་། སྙམ་དུ་མི་སེམས་སོ།
en: It does not think, ‘May the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, and the perfection of meditative concentration follow, outside of me.’

source: །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡང་འདི་སྙམ་དུ་བདག་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་རྗེས་སུ་འབྲང་ངོ་སྙམ་དུ་མི་སེམས་སོ།
en: Furthermore, the perfection of generosity does not think, ‘I will follow the perfection of wisdom.’

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡང་འདི་སྙམ་དུ་བདག་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་རྗེས་སུ་འབྲང་ངོ་སྙམ་དུ་མི་སེམས་སོ།
en: The perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, and the perfection of meditative concentration do not think, ‘I will follow the perfection of wisdom.’

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་དག་གི་རང་བཞིན་ནི་འདི་ཡིན་ཏེ།
en: If you ask why, this is their nature.

source: ཅི་ཡང་ནུས་པ་མེད་པ་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་ཞིང་གསོག་སྟེ། སྨིག་རྒྱུ་བ་ལྟ་བུའོ། །དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: They are incapable of anything, empty of essential nature and vacuous, like a mirage.”

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་སྟོང་པ་ལགས་ན། བཅོམ་ལྡན་འདས་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: Then the venerable Subhūti asked the Blessed One, “Blessed Lord, if all phenomena are naturally empty, in that case, Blessed Lord, how do bodhisattva great beings who practice the perfection of generosity, and who practice the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom attain consummate buddhahood in unsurpassed, complete enlightenment?” “

source: བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པའི་ཚེ།
en: In this regard, Subhūti,” replied the Blessed One, “when bodhisattva great beings practice the six perfections, they think, ‘Alas!

source: འདི་སྙམ་དུ་ཀྱེ་མ་འཇིག་རྟེན་གནས་པ་འདི་ནི་སེམས་ཕྱིན་ཅི་ལོག་ཏུ་གྱུར་པ་སྟེ།
en: This world system has resorted to erroneous thought.

source: དེ་དག་ནི་ཐབས་ལ་མི་མཁས་པས་འཁོར་བ་ནས་ཡོངས་སུ་གདོན་པར་མི་ནུས་ཀྱིས། མ་ལ་བདག་གིས་སེམས་ཅན་དེ་དག་གི་དོན་དུ་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱད་པར་བྱའོ།
en: These [beings] cannot extricate themselves from cyclic existence owing to their lack of skill in means, but I will now practice the perfection of generosity for the sake of these beings!

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱད་པར་བྱའོ། །བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱད་པར་བྱའོ། །བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱད་པར་བྱའོ། །བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱད་པར་བྱའོ། །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱད་པར་བྱའོ།
en: I will practice the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom [for their sake].’ {

source: །སྙམ་ནས།
en: Ki.

source: དེ་སེམས་ཅན་དེ་དག་གི་དོན་དུ་ཕྱི་ནང་གི་དངོས་པོ་རྣམས་ཡོངས་སུ་གཏོང་སྟེ། དེ་ཡོངས་སུ་གཏོང་བའི་ཚེ་འདི་སྙམ་སྟེ། བདག་གིས་གང་ཡང་ཡོངས་སུ་མ་བཏང་བ་མེད་དོ།
en: V: 53} Then, for the sake of those beings, they dispense outer and inner possessions, and when they dispense those possessions, they think, ‘I have not dispensed anything at all.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་དངོས་པོ་འདི་དག་ནི་བདག་ཉིད་འཇིག་པའོ་སྙམ་སྟེ།
en: If you ask why, it is because these phenomena are themselves perishable.’

source: རབ་འབྱོར་དེ་ལྟར་ཡོངས་སུ་རྟོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ།
en: Subhūti, bodhisattva great beings who reflect in that manner fulfill the perfection of generosity. “

source: །དེ་སེམས་ཅན་དེ་དག་ཉིད་ཀྱི་དོན་དུ་ཚུལ་ཁྲིམས་ངན་པའི་སྐབས་མི་འབྱེད་དེ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་དེ་ནི་འདི་སྙམ་དུ་སེམས་ཏེ།
en: For the sake of those beings, they offer no opportunity for degenerate morality.

source: བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་ཞུགས་ལ་སྲོག་གཅོད་པ་དང་། མ་བྱིན་པར་ལེན་པ་དང་། འདོད་པས་ལོག་པར་གཡེམ་པ་དང་། བརྫུན་གྱི་ཚིག་སྨྲ་བ་དང་། ཕྲ་མ་ཅན་དུ་འགྱུར་བ་དང་། ཞེ་གཅོད་པའི་ཚིག་སྨྲ་བ་དང་། ཚིག་ཀྱལ་པ་ཅན་དུ་འགྱུར་བ་དང་། ཆགས་སེམས་ཅན་དུ་འགྱུར་བ་དང་། གནོད་སེམས་སུ་བྱེད་པ་དང་། ལོག་པར་ལྟ་བ་ཅན་དུ་འགྱུར་བ་དང་། ཡུལ་ལ་སྨོན་པ་དང་། ལྷ་དང་།
en: If you ask why, it is because they think, ‘Now that I have set out for unsurpassed, complete enlightenment, I do not resemble those who kill living creatures, steal, commit sexual misconduct, tell lies, slander, speak words of reprimand, resort to nonsensical chatter, are covetous, indulge in malice, resort to wrong views, or who aspire toward objects, or aspire to deities, to Brahmā, or to the level of the śrāvakas or the level of the pratyekabuddhas.’

source: ཚངས་པ་དང་། ཉན་ཐོས་ཀྱི་ས་དང་། རང་སངས་རྒྱས་ཀྱི་སར་སྨོན་པ་འདི་དག་ནི་བདག་ལ་ཚུལ་དང་མི་འདྲའོ་སྙམ་སྟེ། རབ་འབྱོར་དེ་ལྟར་ཡོངས་སུ་རྟོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ཡིན་ནོ།
en: Subhūti, bodhisattva great beings who reflect in that manner practice the perfection of ethical discipline. “

source: །དེ་སེམས་ཅན་དེ་དག་ཉིད་ཀྱི་དོན་དུ་ཚིག་རྩུབ་པ་དང་བརླང་པས་རྟག་ཏུ་སྤྱོས་ཤིང་བརྒྱད་ཀྱང་འཁྲུག་པའི་སེམས་མི་སྐྱེད།
en: For the sake of those same beings, their minds are unagitated even when they are always scolded and rebuked with harsh and coarse words.

source: རྡོ་དབྱུག་དང་། བོང་བ་དང་། མཚོན་གྱིས་བཏབ་ཅིང་བསྣུན་པ་དང་། ལུས་ཀྱི་ཡན་ལག་གཤེགས་སམ། ཉིང་ལག་བཅད་ཀྱང་ཞེ་སྡང་གི་སེམས་མི་སྐྱེད་དོ།
en: Thoughts of hatred do not arise even when they are struck and pierced with stones, clubs, clods of earth, or weapons, or when their limbs are cut off, or their appendages severed.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་དེ་ནི་སྒྲ་ཐམས་ཅད་སྒྲ་བརྙན་ལྟ་བུར་ཡོངས་སུ་རྟོག་གོ །གཟུགས་ཐམས་ཅད་དབུ་བ་ལྟ་བུར་ཡོངས་སུ་རྟོག་གོ།
en: If you ask why, it is because they reflect that all words are like an echo, and all forms are like a mass of foam.

source: །རབ་འབྱོར་དེ་ལྟར་ཡོངས་སུ་རྟོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ཡིན་ནོ།
en: Subhūti, bodhisattva great beings who reflect in that manner practice the perfection of tolerance. “

source: །སེམས་ཅན་དེ་དག་ཉིད་ཀྱི་དོན་དུ་དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཡོངས་སུ་བཙལ་བའི་ཕྱིར་ལེ་ལོའི་སེམས་མི་སྐྱེད་དོ།
en: For the sake of those same beings, in order that they might seek out all the roots of virtuous action, they do not cultivate thoughts of idleness.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་དེ་ནི་འདི་སྙམ་དུ་སེམས་ཏེ། མཐོ་རིས་སུ་སྐྱེ་བ་ཡང་ལེ་ལོ་ཅན་གྱིས་རྙེད་པར་དཀའ་ན། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལྟ་ཅི་སྨོས་ཀྱིས།
en: If you ask why, it is because they think, ‘If it is hard on account of idleness to find even a rebirth in the exalted realms, how much more so in the case of unsurpassed, complete enlightenment.

source: དེ་བས་ན་བདག་གིས་ནམ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཀྱི་བར་དུ་བརྩོན་འགྲུས་བརྩམ་པར་བྱའོ།
en: Therefore, I will undertake perseverance until I have attained consummate buddhahood in unsurpassed, complete enlightenment!

source: །དེ་དག་རྟག་ཏུ་བརྩོན་པ་མི་འདོར་བར་བྱའོ་སྙམ་སྟེ།
en: I shall never desist from persevering in it!’
